[
  {
   "id": 1,
   "name": "Sate Ayam",
   "calories": 225,
   "fat": 14.82,
   "carbohydrates": 4.87,
   "protein": 19.54,
   "description": "Sate ayam, yang terbuat dari potongan daging ayam yang ditusuk dan dipanggang, dapat menjadi sumber protein hewani yang baik. Protein ini penting untuk membangun dan memperbaiki jaringan tubuh, termasuk otot dan sel."
  },
  {
   "id": 2,
   "name": "Sate Maranggi",
   "calories": 192,
   "fat": 8.12,
   "carbohydrates": 4.68,
   "protein": 25.04,
   "description": "Sate Maranggi, khususnya yang terbuat dari daging sapi, memberikan protein dan zat besi. Zat besi adalah nutrisi penting untuk pembentukan sel darah merah dan transportasi oksigen dalam tubuh."
  },
  {
   "id": 3,
   "name": "Nasi Putih",
   "calories": 129,
   "fat": 0.28,
   "carbohydrates": 27.9,
   "protein": 2.66,
   "description": "Nasi putih menyediakan karbohidrat kompleks yang merupakan sumber energi utama bagi tubuh. Ini juga rendah lemak dan kolesterol, membuatnya menjadi komponen penting dalam diet seimbang."
  },
  {
   "id": 4,
   "name": "Nasi Kuning",
   "calories": 95,
   "fat": 0.17,
   "carbohydrates": 20.86,
   "protein": 1.89,
   "description": "Nasi kuning, yang diberi warna oleh kunyit, memberikan antioksidan dan memiliki potensi manfaat anti-inflamasi. Selain itu, kunyit juga dapat mendukung fungsi pencernaan."
  },
  {
   "id": 5,
   "name": "Nasi Goreng",
   "calories": 168,
   "fat": 6.23,
   "carbohydrates": 21.06,
   "protein": 6.3,
   "description": "Nasi goreng mengandung karbohidrat, protein, dan lemak. Namun, karena proses penggorengan, penting untuk mengonsumsinya dengan porsi yang moderat agar tidak terlalu tinggi lemak dan kalori."
  },
  {
   "id": 6,
   "name": "Tempe Goreng",
   "calories": 225,
   "fat": 15.21,
   "carbohydrates": 11.94,
   "protein": 13.31,
   "description": "Tempe goreng menyediakan protein nabati, serat, dan nutrisi lainnya. Tempe juga mengandung probiotik alami yang baik untuk kesehatan pencernaan."
  },
  {
   "id": 7,
   "name": "Tahu Goreng",
   "calories": 271,
   "fat": 20.18,
   "carbohydrates": 10.49,
   "protein": 17.19,
   "description": " Tahu goreng adalah sumber protein nabati dan bisa menjadi alternatif yang sehat. Namun, seperti tempe goreng, penting untuk memperhatikan porsi dan metode penggorengan."
  },
  {
   "id": 8,
   "name": "Telur Ceplok",
   "calories": 201,
   "fat": 15.31,
   "carbohydrates": 0.88,
   "protein": 13.63,
   "description": "Telur ceplok memberikan protein, vitamin B12, dan nutrisi penting lainnya. Namun, perlu diperhatikan bahwa telur juga mengandung kolesterol, sehingga disarankan untuk mengonsumsinya secara moderat."
  },
  {
   "id": 9,
   "name": "Telur Dadar",
   "calories": 93,
   "fat": 7.33,
   "carbohydrates": 0.42,
   "protein": 6.48,
   "description": " Telur dadar adalah sumber protein dan nutrisi seperti vitamin D dan vitamin B12. Kembali, membatasi konsumsi lemak jenuh dan kolesterol tetap penting."
  },
  {
   "id": 10,
   "name": "Soto Ayam",
   "calories": 130,
   "fat": 6.19,
   "carbohydrates": 8.11,
   "protein": 9.96,
   "description": "Soto ayam menyediakan protein dari daging ayam, vitamin, dan mineral dari sayuran seperti tauge dan seledri. Kaldu ayam yang digunakan dapat memberikan nutrisi tambahan dan juga membantu hidrasi."
  },
  {
   "id": 11,
   "name": "Kimchi",
   "calories": 22,
   "fat": 0.32,
   "carbohydrates": 4.16,
   "protein": 1.73,
   "description": "Kimchi adalah sumber probiotik alami karena mengalami fermentasi. Probiotik mendukung kesehatan saluran pencernaan dan sistem kekebalan tubuh. Selain itu, kimchi mengandung serat dan nutrisi dari sayuran fermentasinya."
  },
  {
   "id": 12,
   "name": "Bakso Sapi",
   "calories": 202,
   "fat": 13.16,
   "carbohydrates": 7.58,
   "protein": 12.41,
   "description": "Bakso sapi mengandung protein tinggi dari daging sapi, yang penting untuk pertumbuhan dan perbaikan sel tubuh. Sup kaldu bakso juga dapat memberikan asupan cairan dan nutrisi."
  },
  {
   "id": 13,
   "name": "Pecel Lele",
   "calories": 194,
   "fat": 11.48,
   "carbohydrates": 7.93,
   "protein": 15.37,
   "description": "Pecel lele memberikan protein dari ikan lele, serta serat dan vitamin dari sayuran segar. Meskipun lele digoreng, membatasi konsumsi gorengan adalah penting untuk menjaga kesehatan jantung."
  },
  {
   "id": 14,
   "name": "Ayam Geprek",
   "calories": 263,
   "fat": 17.9,
   "carbohydrates": 7.6,
   "protein": 17.61,
   "description": "Ayam geprek memberikan protein dari ayam, namun, karena diuleg dan digoreng, perlu diperhatikan penggunaan minyak dan porsi agar tidak terlalu tinggi lemak dan kalori."
  },
  {
   "id": 15,
   "name": "Pecel",
   "calories": 463,
   "fat": 30.38,
   "carbohydrates": 40.04,
   "protein": 15.63,
   "description": "Pecel memberikan serat dan nutrisi dari sayuran rebus dan sambal kacang. Konsumsi sayuran dapat membantu menjaga kesehatan pencernaan dan memberikan vitamin dan mineral penting."
  },
  {
   "id": 16,
   "name": "Gado-gado",
   "calories": 132,
   "fat": 7.41,
   "carbohydrates": 10.9,
   "protein": 7.14,
   "description": "Gado-gado kaya akan sayuran yang memberikan serat, vitamin, dan mineral. Bumbu kacang memberikan protein dan lemak sehat. Hidangan ini merupakan sumber energi dan nutrisi yang seimbang."
  },
  {
   "id": 17,
   "name": "Ketoprak",
   "calories": 201,
   "fat": 7.67,
   "carbohydrates": 25.24,
   "protein": 7.8,
   "description": "Ketoprak menyediakan protein nabati dari tahu, serat dari sayuran dan bumbu kacang. Hidangan ini cocok untuk vegetarian dan menyumbangkan nutrisi esensial."
  },
  {
   "id": 18,
   "name": "Mie Goreng",
   "calories": 380,
   "fat": 12,
   "carbohydrates": 52,
   "protein": 8,
   "description": "Mie goreng, meskipun lezat, sebaiknya dikonsumsi dengan bijak karena kandungan lemak dan kalorinya yang tinggi. Pilihannya dalam hal jenis mie dan penggunaan minyak dapat mempengaruhi dampak kesehatannya."
  },
  {
   "id": 19,
   "name": "Ayam Gulai",
   "calories": 168,
   "fat": 12.4,
   "carbohydrates": 3.33,
   "protein": 11.94,
   "description": "Ayam gulai menyediakan protein dan lemak dari santan. Sementara rempah-rempah dalam gulai dapat memberikan manfaat anti-inflamasi. Penting untuk mengonsumsinya dengan porsi yang seimbang untuk menghindari konsumsi lemak jenuh yang berlebihan."
  },
  {
   "id": 20,
   "name": "Ayam Goreng",
   "calories": 260,
   "fat": 14.55,
   "carbohydrates": 10.76,
   "protein": 21.93,
   "description": "Ayam Goreng adalah hidangan ayam yang diolah dengan cara digoreng hingga kulitnya menjadi renyah dan dagingnya tetap lezat. Ayam ini sering diberi bumbu khusus sebelum digoreng untuk menambah cita rasa."
  },
  {
   "id": 21,
   "name": "Ayam Bakar",
   "calories": 188,
   "fat": 7.35,
   "carbohydrates": 0,
   "protein": 28.69,
   "description": "Ayam Bakar adalah hidangan ayam yang dipanggang atau dibakar setelah direndam dalam bumbu khusus. Proses pemanggangan memberikan aroma harum dan rasa yang unik pada ayam."
  },
  {
   "id": 22,
   "name": "Rendang",
   "calories": 195,
   "fat": 11.07,
   "carbohydrates": 4.49,
   "protein": 19.68,
   "description": "Rendang adalah hidangan daging (biasanya daging sapi) yang dimasak dalam santan dan rempah-rempah hingga kuah menyusut dan daging menjadi empuk. Rendang memiliki rasa gurih, pedas, dan manis yang khas."
  },
  {
   "id": 23,
   "name": "Kerupuk Putih",
   "calories": 432,
   "fat": 14.04,
   "carbohydrates": 69.32,
   "protein": 5.51,
   "description": "Kerupuk Putih adalah camilan ringan yang terbuat dari tepung tapioka yang digoreng. Biasanya memiliki tekstur yang renyah dan sering dihidangkan sebagai pendamping dalam hidangan."
  },
  {
   "id": 24,
   "name": "Daun Singkong",
   "calories": 38,
   "fat": 0.29,
   "carbohydrates": 7.25,
   "protein": 3.66,
   "description": "Daun Singkong biasanya dimasak sebagai lalapan atau diolah dalam hidangan pepes. Daun ini memiliki tekstur yang lembut setelah dimasak dan memberikan aroma khas."
  },
  {
   "id": 25,
   "name": "Ikan Tongkol Goreng",
   "calories": 200,
   "fat": 11.41,
   "carbohydrates": 2.38,
   "protein": 20.95,
   "description": "Ikan Tongkol Goreng adalah hidangan ikan yang digoreng hingga kulitnya krispi dan dagingnya tetap lembut. Ikan ini sering diolah dengan bumbu dan rempah sebelum digoreng."
  },
  {
   "id": 26,
   "name": "Kikil",
   "calories": 100,
   "fat": 4.53,
   "carbohydrates": 4.16,
   "protein": 10.88,
   "description": "Kikil adalah hidangan yang menggunakan potongan kaki sapi sebagai bahan utama. Biasanya dimasak dalam kuah santan dan bumbu, memberikan rasa kaya dan daging yang empuk."
  },
  {
   "id": 27,
   "name": "Sayur Nangka",
   "calories": 66,
   "fat": 3.5,
   "carbohydrates": 8.7,
   "protein": 1.3,
   "description": "Sayur Nangka adalah hidangan sayuran yang dimasak dengan santan dan rempah-rempah. Buah nangka muda memberikan rasa manis dan tekstur yang unik pada hidangan."
  },
  {
   "id": 28,
   "name": "Nasi merah",
   "calories": 110,
   "fat": 0.89,
   "carbohydrates": 22.78,
   "protein": 2.56,
   "description": "Nasi Merah adalah variasi nasi yang berwarna cokelat ke-merahan dan lebih kaya akan serat, vitamin, dan mineral dibandingkan dengan nasi putih biasa."
  },
  {
   "id": 29,
   "name": "Martabak Telur",
   "calories": 203,
   "fat": 8.45,
   "carbohydrates": 20.38,
   "protein": 10.89,
   "description": "Martabak Telur adalah hidangan lempeng tipis yang diisi dengan campuran telur, daging cincang, bawang, dan rempah-rempah. Biasanya dilipat dan digoreng hingga kulitnya krispi dan isinya matang. Martabak Telur sering disajikan dengan saus kacang atau saus pedas sebagai pelengkap."
  },
  {
   "id": 30,
   "name": "Martabak Manis",
   "calories": 300,
   "fat": 12.57,
   "carbohydrates": 41.52,
   "protein": 7.78,
   "description": "Martabak Manis adalah pancake tebal Indonesia yang biasanya diisi dengan gula, cokelat, kacang, keju, atau susu kental manis. Dibalut dengan adonan lembut dan lezat, martabak manis umumnya diolah dengan cara dipanggang."
  },
  {
   "id": 31,
   "name": "Lontong",
   "calories": 144,
   "fat": 0.23,
   "carbohydrates": 31.76,
   "protein": 2.76,
   "description": "Lontong adalah nasi yang dimasak dalam anyaman daun pisang sehingga membentuk silinder padat. Umumnya digunakan sebagai pendamping dalam hidangan khas Indonesia."
  },
  {
   "id": 32,
   "name": "Lontong Sayur",
   "calories": 89,
   "fat": 2.1,
   "carbohydrates": 14.77,
   "protein": 2.78,
   "description": "Lontong Sayur adalah hidangan Indonesia yang terdiri dari lontong yang disajikan dengan kuah sayur berbumbu khas, seringkali berisi sayuran dan daging."
  },
  {
   "id": 33,
   "name": "Sayur Bayam",
   "calories": 23,
   "fat": 0.39,
   "carbohydrates": 3.63,
   "protein": 2.86,
   "description": "Sayur Bayam adalah hidangan sayur yang menggunakan bayam sebagai bahan utama. Biasanya dimasak dalam kuah dengan bumbu khas Indonesia."
  },
  {
   "id": 34,
   "name": "Sayur Lodeh",
   "calories": 68,
   "fat": 3.95,
   "carbohydrates": 6.14,
   "protein": 2.78,
   "description": "Sayur Lodeh adalah hidangan sayur Indonesia yang dimasak dalam santan kelapa dengan berbagai macam sayuran, kadang-kadang juga dengan tambahan daging atau tahu."
  },
  {
   "id": 35,
   "name": "Sayur Kangkung",
   "calories": 20,
   "fat": 0.34,
   "carbohydrates": 3.18,
   "protein": 2.51,
   "description": "Sayur Kangkung adalah hidangan sayuran yang menggunakan kangkung sebagai bahan utama. Umumnya dimasak dengan bumbu khas Indonesia."
  },
  {
   "id": 36,
   "name": "Kacang Panjang Rebus",
   "calories": 59,
   "fat": 3.1,
   "carbohydrates": 7.61,
   "protein": 1.82,
   "description": "Kacang Panjang Rebus adalah hidangan sayur yang menggunakan kacang panjang yang direbus dan seringkali disajikan sebagai lalapan atau pendamping hidangan utama."
  },
  {
   "id": 37,
   "name": "Terong Goreng",
   "calories": 148,
   "fat": 10.75,
   "carbohydrates": 11.58,
   "protein": 2.4,
   "description": "Terong Goreng adalah hidangan yang menggunakan terong yang digoreng hingga kulitnya menjadi renyah. Terong ini biasanya diolah dengan bumbu dan rempah sebelum digoreng."
  },
  {
   "id": 38,
   "name": "Toge Goreng",
   "calories": 94,
   "fat": 2.8,
   "carbohydrates": 14.22,
   "protein": 5.25,
   "description": "Toge Goreng adalah hidangan Indonesia yang terdiri dari tauge yang digoreng bersama dengan bumbu kacang, tahu, dan kadang-kadang mie goreng."
  },
  {
   "id": 39,
   "name": "Paru Sapi Goreng",
   "calories": 484,
   "fat": 36.5,
   "carbohydrates": 0.62,
   "protein": 39.61,
   "description": "Paru Sapi Goreng adalah hidangan yang menggunakan paru sapi yang direbus dan kemudian digoreng. Paru sapi ini seringkali diolah dengan bumbu khas untuk memberikan rasa yang kaya."
  },
  {
   "id": 40,
   "name": "Tempe Orek",
   "calories": 175,
   "fat": 8.2,
   "carbohydrates": 15.6,
   "protein": 13.11,
   "description": "Tempe Orek adalah hidangan Indonesia yang terbuat dari tempe yang digoreng dan kemudian dimasak dengan bumbu dan saus manis."
  },
  {
   "id": 41,
   "name": "Tahu Bacem",
   "calories": 95,
   "fat": 5.86,
   "carbohydrates": 4.37,
   "protein": 7.62,
   "description": "Tahu Bacem adalah hidangan tahu yang dimasak dalam kuah kental berbumbu, memberikan rasa manis dan gurih pada tahu."
  },
  {
   "id": 42,
   "name": "Telur Rebus",
   "calories": 154,
   "fat": 10.57,
   "carbohydrates": 1.12,
   "protein": 12.53,
   "description": "Telur Rebus adalah telur yang dimasak dalam air mendidih hingga kuning telurnya matang sempurna. Telur rebus sering dijadikan sebagai tambahan dalam berbagai hidangan."
  },
  {
   "id": 43,
   "name": "Pizza keju",
   "calories": 276,
   "fat": 11.74,
   "carbohydrates": 30.33,
   "protein": 12.33,
   "description": "Pizza Keju adalah hidangan pizza yang umumnya terdiri dari adonan roti yang dihias dengan saus tomat, keju, dan bahan-bahan tambahan sesuai selera."
  },
  {
   "id": 44,
   "name": "Spaghetti Carbonara",
   "calories": 422,
   "fat": 23.53,
   "carbohydrates": 28.63,
   "protein": 22.7,
   "description": "Spaghetti Carbonara adalah hidangan pasta yang diolah dengan saus yang terbuat dari telur, keju parmesan, bacon, dan lada hitam."
  },
  {
   "id": 45,
   "name": "Hamburger",
   "calories": 240,
   "fat": 8,
   "carbohydrates": 31,
   "protein": 12,
   "description": " Hamburger adalah hidangan yang terdiri dari daging patty yang digoreng atau dipanggang, ditempatkan di dalam roti bundar, dan umumnya disajikan dengan saus, sayuran, dan keju."
  },
  {
   "id": 46,
   "name": "Hotdog",
   "calories": 247,
   "fat": 14.84,
   "carbohydrates": 18.4,
   "protein": 10.6,
   "description": "Hotdog adalah sosis daging yang dimasak dan ditempatkan di dalam roti panjang. Umumnya disajikan dengan berbagai topping seperti saus tomat, mayones, mustard, dan bawang goreng."
  },
  {
   "id": 47,
   "name": "Kebab",
   "calories": 159,
   "fat": 4.27,
   "carbohydrates": 19.77,
   "protein": 9.71,
   "description": "Kebab adalah hidangan daging yang biasanya disajikan dalam roti tipis atau tortilla, seringkali disertai dengan saus, sayuran, dan yogurt."
  },
  {
   "id": 48,
   "name": "Sop Kaki Kambing",
   "calories": 109,
   "fat": 2.31,
   "carbohydrates": 0,
   "protein": 20.56,
   "description": "Sop Kaki Kambing adalah sup yang terbuat dari kaki kambing yang dimasak dalam kuah bening dengan berbagai rempah-rempah, sayuran, dan kadang-kadang mie."
  },
  {
   "id": 49,
   "name": "Es Teh",
   "calories": 38,
   "fat": 0,
   "carbohydrates": 9.89,
   "protein": 0.01,
   "description": "Es Teh adalah minuman yang terbuat dari teh yang diseduh dan kemudian didinginkan dengan es batu. Biasanya diberi pemanis, seperti gula atau sirup, sesuai selera."
  },
  {
   "id": 50,
   "name": "MIe Ayam",
   "calories": 421,
   "fat": 18.74,
   "carbohydrates": 46.21,
   "protein": 16.7,
   "description": " Mie Ayam adalah hidangan mi rebus yang disajikan dengan potongan daging ayam, pangsit rebus, tauge, dan irisan daun bawang. Biasanya diberi tambahan bawang goreng dan saus khusus."
  },
  {
   "id": 51,
   "name": "Nugget",
   "calories": 48,
   "fat": 3.01,
   "carbohydrates": 2.61,
   "protein": 2.49,
   "description": "Nugget adalah potongan daging yang diolah dan dibentuk menjadi kotak atau silinder, kemudian digoreng atau dipanggang. Biasanya terbuat dari daging ayam atau ikan, dan sering dihidangkan sebagai camilan."
  },
  {
   "id": 52,
   "name": "Krecek",
   "calories": 122,
   "fat": 7.89,
   "carbohydrates": 9.95,
   "protein": 4.64,
   "description": "Krecek adalah hidangan Jawa yang terbuat dari kulit sapi yang direbus dan kemudian diolah dengan bumbu kacang. Krecek biasanya disajikan sebagai pelengkap nasi."
  },
  {
   "id": 53,
   "name": "Ceker ayam",
   "calories": 215,
   "fat": 14.6,
   "carbohydrates": 0.2,
   "protein": 19.4,
   "description": "Ceker Ayam adalah hidangan yang menggunakan kaki ayam yang dimasak dengan berbagai bumbu, kemudian digoreng atau direbus. Ceker ayam umumnya memiliki tekstur kenyal dan disajikan dengan saus pedas."
  },
  {
   "id": 54,
   "name": "Capcay",
   "calories": 67,
   "fat": 2.59,
   "carbohydrates": 9.67,
   "protein": 1.58,
   "description": "Capcay adalah hidangan tumis sayuran yang biasanya terdiri dari berbagai macam sayuran seperti brokoli, wortel, kembang kol, jamur, dan daging ayam atau udang. Disajikan dengan saus kacang."
  },
  {
   "id": 55,
   "name": "Kwetiau Goreng",
   "calories": 338,
   "fat": 12.3,
   "carbohydrates": 18,
   "protein": 3,
   "description": "Kwetiau Goreng adalah hidangan Tionghoa-Indonesia yang menggunakan kwetiau (mi kering) yang digoreng bersama dengan berbagai bahan seperti daging, seafood, dan sayuran."
  },
  {
   "id": 56,
   "name": "Kwetiau Siram",
   "calories": 369,
   "fat": 6.6,
   "carbohydrates": 54,
   "protein": 23.2,
   "description": "Kwetiau Siram adalah hidangan yang menggunakan kwetiau yang direbus dan disiram dengan kuah kental berbumbu, biasanya berisi daging, seafood, dan sayuran."
  },
  {
   "id": 57,
   "name": "Mie Rebus",
   "calories": 300,
   "fat": 11,
   "carbohydrates": 43,
   "protein": 7,
   "description": "Mie Rebus adalah hidangan mi yang direbus dan disajikan dengan kuah berbumbu, potongan daging atau seafood, tauge, dan daun bawang. Biasanya disertai dengan tambahan bawang goreng."
  },
  {
   "id": 58,
   "name": "Roti Tawar",
   "calories": 100,
   "fat": 1.5,
   "carbohydrates": 18.5,
   "protein": 3.5,
   "description": "Roti Tawar adalah roti yang dipanggang atau dipanggang tanpa kulit luar. Umumnya dijadikan sebagai dasar untuk pembuatan sandwich atau dicocol dengan berbagai saus dan selai."
  },
  {
   "id": 59,
   "name": "Sambal",
   "calories": 175,
   "fat": 10,
   "carbohydrates": 20,
   "protein": 5,
   "description": "Sambal adalah saus pedas khas Indonesia yang terbuat dari cabai, bawang, dan bumbu-bumbu lainnya yang dihaluskan. Sambal digunakan sebagai pelengkap untuk menambah rasa pada hidangan."
  },
  {
   "id": 60,
   "name": "Sayur Asem",
   "calories": 33,
   "fat": 1.15,
   "carbohydrates": 5.38,
   "protein": 1.32,
   "description": "Sayur Asem adalah hidangan sayuran berkuah asam yang menggunakan tamarind sebagai bahan utama. Biasanya berisi berbagai macam sayuran dan kadang-kadang ditambahkan dengan daging atau ikan."
  },
  {
   "id": 61,
   "name": "Telur Asin",
   "calories": 183,
   "fat": 13.63,
   "carbohydrates": 1.44,
   "protein": 12.68,
   "description": "Telur Asin adalah telur yang diawetkan dengan cara direndam dalam campuran garam dan air. Telur asin sering dijadikan pelengkap untuk berbagai hidangan."
  },
  {
   "id": 62,
   "name": "Perkedel kentang",
   "calories": 143,
   "fat": 7.46,
   "carbohydrates": 16.52,
   "protein": 3.05,
   "description": "Perkedel Kentang adalah hidangan gorengan yang terbuat dari kentang yang dihaluskan dan dicampur dengan bumbu-bumbu tertentu, kemudian dibentuk bulat dan digoreng."
  },
  {
   "id": 63,
   "name": "Takoyaki",
   "calories": 175,
   "fat": 7.56,
   "carbohydrates": 17.77,
   "protein": 8.45,
   "description": "Takoyaki adalah bola-bola adonan berisi potongan gurita, dicetak dalam cetakan khusus, dan digoreng hingga berwarna kecokelatan. Umumnya disajikan dengan saus takoyaki dan serutan ikan katsuobushi."
  },
  {
   "id": 64,
   "name": "Croissant",
   "calories": 406,
   "fat": 21,
   "carbohydrates": 45.8,
   "protein": 8.2,
   "description": "Croissant adalah kue berlapis yang terbuat dari adonan yang kaya mentega. Biasanya memiliki lapisan yang renyah dan berongga."
  },
  {
   "id": 65,
   "name": "Roti Bakar",
   "calories": 307,
   "fat": 5.62,
   "carbohydrates": 53.71,
   "protein": 12.84,
   "description": "Roti Bakar adalah roti yang dipanggang atau dipanggang, seringkali diolesi mentega atau selai, dan bisa disajikan dengan berbagai topping seperti keju, pisang, atau selai kacang."
  },
  {
   "id": 66,
   "name": "Lemper",
   "calories": 190,
   "fat": 7.99,
   "carbohydrates": 21.3,
   "protein": 8.55,
   "description": "Lemper adalah hidangan Indonesia yang terbuat dari ketan yang dibungkus dalam daun pisang, berisi lauk seperti ayam atau daging sapi yang dimasak dengan santan."
  },
  {
   "id": 67,
   "name": "Risol Mayo",
   "calories": 275,
   "fat": 15.47,
   "carbohydrates": 23.94,
   "protein": 9.32,
   "description": "Risol Mayo adalah hidangan gorengan berbentuk bulat atau segitiga yang berisi campuran ragout daging atau sayuran, dan kadang-kadang disajikan dengan saus mayonaise."
  },
  {
   "id": 68,
   "name": "Cahkwe",
   "calories": 417,
   "fat": 19.84,
   "carbohydrates": 53.36,
   "protein": 6.59,
   "description": "Cahkwe atau Cakwe adalah kue goreng yang berbentuk panjang, biasanya disajikan sebagai camilan dengan rasa yang gurih."
  },
  {
   "id": 69,
   "name": "Tahu Bakso",
   "calories": 192,
   "fat": 10.1,
   "carbohydrates": 17.8,
   "protein": 9.84,
   "description": "Tahu Bakso adalah hidangan yang menggunakan tahu yang diisi dengan bola-bola bakso (daging sapi giling) dan kemudian digoreng atau direbus."
  },
  {
   "id": 70,
   "name": "Bakwan",
   "calories": 228,
   "fat": 19.31,
   "carbohydrates": 11.23,
   "protein": 3.31,
   "description": "Bakwan adalah gorengan berbentuk bulat yang terbuat dari adonan berisi berbagai sayuran seperti wortel, kol, dan rebung."
  },
  {
   "id": 71,
   "name": "Pempek",
   "calories": 195,
   "fat": 5.2,
   "carbohydrates": 23.58,
   "protein": 12.61,
   "description": "Pempek adalah hidangan khas Palembang, Indonesia, yang terbuat dari adonan tepung sagu dan ikan yang digoreng dan disajikan dengan saus cuko khasnya."
  },
  {
   "id": 72,
   "name": "Udang Goreng",
   "calories": 287,
   "fat": 14.64,
   "carbohydrates": 27.57,
   "protein": 10.58,
   "description": "Udang Goreng adalah hidangan yang menggunakan udang yang dibalut dalam adonan tepung dan digoreng hingga kulitnya renyah."
  },
  {
   "id": 73,
   "name": "Cumi Goreng Tepung",
   "calories": 125,
   "fat": 2.17,
   "carbohydrates": 9.9,
   "protein": 15.13,
   "description": "Cumi Goreng Tepung adalah hidangan yang menggunakan cumi-cumi yang dicelupkan dalam adonan tepung dan digoreng hingga berwarna keemasan."
  },
  {
   "id": 74,
   "name": "Sate Lilit",
   "calories": 257,
   "fat": 18.07,
   "carbohydrates": 3.58,
   "protein": 19.58,
   "description": "Sate Lilit adalah hidangan sate khas Bali, Indonesia, yang menggunakan daging yang dicincang halus dan dibalutkan di sekitar bambu atau seruling lidi sebelum dipanggang."
  },
  {
   "id": 75,
   "name": "Gudeg",
   "calories": 127,
   "fat": 4.71,
   "carbohydrates": 22.54,
   "protein": 1.82,
   "description": "Gudeg adalah hidangan khas Yogyakarta, Indonesia, yang terbuat dari nangka muda yang dimasak dalam santan dan bumbu, biasanya disajikan dengan ayam, telur, dan sambal krecek."
  },
  {
   "id": 76,
   "name": "Lobster rebus",
   "calories": 97,
   "fat": 0.58,
   "carbohydrates": 1.27,
   "protein": 20.33,
   "description": "Lobster Rebus adalah hidangan yang menggunakan lobster yang direbus dan umumnya disajikan dengan saus atau mentega."
  },
  {
   "id": 77,
   "name": "Bebek Goreng",
   "calories": 286,
   "fat": 24.1,
   "carbohydrates": 3.66,
   "protein": 13.05,
   "description": "Bebek Goreng adalah hidangan bebek yang digoreng hingga kulitnya menjadi renyah dan dagingnya empuk. Biasanya disajikan dengan sambal dan nasi."
  },
  {
   "id": 78,
   "name": "Pangsit goreng",
   "calories": 344,
   "fat": 18.87,
   "carbohydrates": 30.47,
   "protein": 12.58,
   "description": "Pangsit Goreng adalah hidangan pangsit yang digoreng hingga renyah. Pangsit ini biasanya diisi dengan campuran daging cincang dan bumbu."
  },
  {
   "id": 79,
   "name": "Brownies",
   "calories": 379,
   "fat": 13.77,
   "carbohydrates": 62.54,
   "protein": 4.76,
   "description": "Brownies adalah kue cokelat padat dan kering yang sering diisi dengan kacang atau cokelat cair. Brownies memiliki tekstur padat dan rasa kaya cokelat."
  },
  {
   "id": 80,
   "name": "Dimsum",
   "calories": 112,
   "fat": 2.64,
   "carbohydrates": 9.56,
   "protein": 11.55,
   "description": "Dimsum adalah hidangan Tionghoa yang terdiri dari berbagai jenis makanan seperti siomay, bakpao, hakau, dan lainnya. Biasanya disajikan dalam keranjang bambu dan dimakan sebagai camilan."
  },
  {
   "id": 81,
   "name": "Rawon",
   "calories": 119,
   "fat": 7.4,
   "carbohydrates": 3.48,
   "protein": 9.6,
   "description": "Rawon adalah hidangan Indonesia yang terbuat dari daging sapi yang dimasak dalam kuah hitam khas karena penggunaan kluwek. Biasanya disajikan dengan nasi putih, tauge, dan telur asin."
  },
  {
   "id": 82,
   "name": "Bubur ayam",
   "calories": 155,
   "fat": 5.16,
   "carbohydrates": 15.05,
   "protein": 11.48,
   "description": "Bubur Ayam adalah bubur nasi yang dimasak hingga lembut dan disajikan dengan potongan daging ayam, bawang goreng, seledri, dan kerupuk."
  },
  {
   "id": 83,
   "name": "Siomay",
   "calories": 138,
   "fat": 2.29,
   "carbohydrates": 16.3,
   "protein": 12.26,
   "description": "Siomay adalah hidangan dimsum Indonesia yang terdiri dari potongan-potongan daging dan sayuran yang dibungkus dalam kulit pangsit, kemudian dikukus dan disajikan dengan saus kacang."
  },
  {
   "id": 84,
   "name": "Serabi",
   "calories": 216,
   "fat": 3.59,
   "carbohydrates": 42.1,
   "protein": 3.17,
   "description": "Serabi adalah kue dadar tipis berbahan dasar tepung beras yang digoreng atau dipanggang, sering disajikan dengan kelapa parut dan gula merah cair."
  },
  {
   "id": 85,
   "name": "Cireng",
   "calories": 348,
   "fat": 22.65,
   "carbohydrates": 31.77,
   "protein": 4.69,
   "description": "Cireng adalah camilan Indonesia yang terbuat dari adonan tepung tapioka yang digoreng hingga berwarna keemasan. Biasanya disajikan dengan saus kacang."
  },
  {
   "id": 86,
   "name": "Seblak",
   "calories": 131,
   "fat": 6.66,
   "carbohydrates": 15.58,
   "protein": 4.07,
   "description": "Seblak adalah hidangan soto pedas yang berasal dari Bandung, Indonesia. Terbuat dari berbagai bahan seperti kerupuk, tahu, siomay, sayuran, dan dimasak dalam kuah pedas."
  },
  {
   "id": 87,
   "name": "nastar",
   "calories": 373,
   "fat": 10.68,
   "carbohydrates": 63.32,
   "protein": 5.69,
   "description": "Nastar adalah kue kering berbentuk bola yang umumnya diisi dengan selai nanas. Biasanya disajikan pada saat perayaan atau hari raya tertentu."
  },
  {
   "id": 88,
   "name": "Kue lumpur",
   "calories": 247,
   "fat": 14.7,
   "carbohydrates": 25.17,
   "protein": 4.49,
   "description": "Kue Lumpur adalah kue tradisional Indonesia yang terbuat dari campuran tepung terigu, kelapa parut, dan gula. Biasanya memiliki tekstur kenyal dan rasa kelapa yang khas."
  },
  {
   "id": 89,
   "name": "Rempeyek",
   "calories": 486,
   "fat": 18.98,
   "carbohydrates": 71.24,
   "protein": 7.57,
   "description": "Rempeyek adalah camilan Indonesia yang terbuat dari adonan berbahan dasar tepung beras dan kelapa parut, kemudian digoreng hingga renyah. Biasanya dihias dengan kacang tanah."
  },
  {
   "id": 90,
   "name": "Papeda",
   "calories": 58,
   "fat": 0.01,
   "carbohydrates": 14.03,
   "protein": 0.04,
   "description": "Papeda adalah hidangan khas Maluku, Indonesia, yang terbuat dari sagu yang direbus hingga membentuk bubur kental. Biasanya disajikan dengan kuah ikan atau daging."
  },
  {
   "id": 91,
   "name": "Rujak",
   "calories": 121,
   "fat": 6.15,
   "carbohydrates": 12.04,
   "protein": 5.99,
   "description": "Rujak adalah hidangan Indonesia berupa campuran buah-buahan yang dipotong kecil-kecil dan disiram dengan saus bumbu rujak pedas atau manis."
  },
  {
   "id": 92,
   "name": "Klepon",
   "calories": 366,
   "fat": 9.34,
   "carbohydrates": 65.82,
   "protein": 4.75,
   "description": "Klepon adalah kue tradisional Indonesia yang berisi gula kelapa yang dibungkus dengan lapisan tepung ketan yang berwarna hijau, dan biasanya dilapisi kelapa parut"
  },
  {
   "id": 93,
   "name": "Kue Pukis",
   "calories": 259,
   "fat": 11.01,
   "carbohydrates": 34.95,
   "protein": 6.12,
   "description": "Kue Pukis adalah kue tradisional Indonesia yang terbuat dari campuran tepung terigu, kelapa parut, santan, dan gula. Dipanggang dalam cetakan khusus, sehingga memiliki tekstur lembut di bagian dalam dan renyah di luar."
  },
  {
   "id": 94,
   "name": "Oatmeal",
   "calories": 70,
   "fat": 2,
   "carbohydrates": 12,
   "protein": 2,
   "description": "Oatmeal adalah bubur yang terbuat dari oat yang direbus dengan air atau susu. Biasanya dihidangkan dengan berbagai tambahan seperti buah, kacang-kacangan, dan madu."
  },
  {
   "id": 95,
   "name": "Pastel",
   "calories": 150,
   "fat": 6.13,
   "carbohydrates": 19.63,
   "protein": 3.8,
   "description": "Pastel adalah hidangan pastry yang terdiri dari lapisan kulit pastry yang diisi dengan campuran daging, kentang, dan sayuran. Biasanya dipanggang hingga kulitnya renyah."
  },
  {
   "id": 96,
   "name": "Lapis legit",
   "calories": 415,
   "fat": 33.65,
   "carbohydrates": 25.26,
   "protein": 5.11,
   "description": "Lapis Legit adalah kue lapis yang terbuat dari lapisan-lapisan tipis adonan berbahan dasar tepung terigu, mentega, telur, dan gula. Proses pembuatannya yang memerlukan banyak lapisan membuatnya memiliki tekstur padat dan rasa yang kaya."
  },
  {
   "id": 97,
   "name": "Pancake",
   "calories": 227,
   "fat": 9.7,
   "carbohydrates": 28.3,
   "protein": 6.4,
   "description": "Pancake adalah kue datar yang dibuat dari adonan berbahan dasar tepung terigu, telur, susu, dan baking powder. Biasanya dimasak di atas pemanggang dan disajikan dengan berbagai topping seperti sirup maple, buah-buahan, atau whipped cream."
  },
  {
   "id": 98,
   "name": "Bakpia",
   "calories": 299,
   "fat": 7.91,
   "carbohydrates": 4768,
   "protein": 9.61,
   "description": "Bakpia adalah kue kering berbentuk bulat atau oval yang diisi dengan campuran kacang hijau, gula, dan biji wijen. Umumnya dikukus atau dipanggang."
  },
  {
   "id": 99,
   "name": "Pisang Goreng",
   "calories": 252,
   "fat": 13.27,
   "carbohydrates": 36.07,
   "protein": 1.47,
   "description": "Pisang Goreng adalah pisang yang dicelup dalam adonan tepung berbumbu dan digoreng hingga kulitnya menjadi renyah. Pisang goreng sering dijadikan camilan populer di berbagai negara."
  }
 ]